[
  {
    "price": "$2,787.14",
    "picture": "https://rapidrepair.in/wp-content/uploads/2018/12/wifi-issues-post-e1545807225507.png",
    "name": "Wifi Is Not Getting Connected",
    "description": "Wifi Is Not Getting Connected or iPhone Wi-Fi is slow one among common iPhone problems and solutions encountered by many users. The solution is really very simple. You just need to simply switch it off and then restart the phone. Simultaneously press and hold the home button and lock button till you get the Apple logo on the screen. Once the phone has restarted, you should be able to connect to Wifi. If still the issues persist, go to Settings, then go to WiFi and scroll down to the page end, make the HTTP proxy to auto settings."
  },
  {
    "price": "$3,459.81",
    "picture": "https://rapidrepair.in/wp-content/uploads/2018/12/Cellular-Connection-Not-Working.jpg",
    "name": "Cellular Connection Not Working on iPhone",
    "description": "There could be multiple reasons why a cellular connection may not be working on your iPhone. For instance, the problem could be due to an outage and network related issues on your iPhone. So, whenever you face this issue, ensure that there is a stable cellular connection and that there is no outage in your area. If the problem continues, you can reset the network settings to get rid of the sluggish network. To do so, go to the Settings app on your device and choose General. Now, tap on Reset and select Reset Network Settings. Once you have successfully reset the network, check out if the problem has been solved."
  },
  {
    "price": "$2,243.36",
    "picture": "https://rapidrepair.in/wp-content/uploads/2021/03/iPhone-Display-Issues.jpg",
    "name": "iPhone is Stuck at Apple Logo",
    "description": "iPhones are synonymous with premium build quality and fluid performance. They are known as some of the best smartphones that money can buy and are trusted by a lot of people worldwide. However, just like any other smartphone, iPhones have their flaws. One of the most common issues that users face is their iPhone display not working or their iPhone screen is blue and not responding to any touches. If you are also facing the blue screen of death issue with your iPhone, then this article will be helpful in troubleshooting the same."
  },
  {
    "price": "$1,136.71",
    "picture": "https://rapidrepair.in/wp-content/uploads/2018/12/iPhone-App-Freezing-Crashing-Randomly.jpg",
    "name": "iPhone App Freezing/Crashing Randomly",
    "description": "Frankly speaking, apps freezing and crashing is the sort of problem that most of us have come across sometime or the other. Well, the good thing is that you can easily sort it out. Mostly, apps tend to freeze or crash when they are outdated. So, make sure the app in question is updated to the latest version (Go to App Store > Profile. After that, head over to the app that you want to update. Then, hit the Update button)."
  },
  {
    "price": "$3,541.03",
    "picture": "https://rapidrepair.in/wp-content/uploads/2018/12/No-newest-version-update-post-e1545809066360.png",
    "name": "No Newest Version Update",
    "description": "Are you searching for common iPhone problems and solutions before buying a new iPhone? One of the common iPhone problems is that iPhone is not getting updated to the newest iOS version. The solution goes like this: simply connect your device to Mac or PC and force restart which will bring your iPhone to recovery mode. Then you will be able to see an update option and when you click on it, the update starts and once it is completed your phone will work as normal. If in case you couldn’t see update option after force restart, try to restore option which will remove all data from the phone. You will now get the latest software version and can be restored with the backed up data."
  },
  {
    "price": "$2,981.15",
    "picture": "https://rapidrepair.in/wp-content/uploads/2021/02/screen.png",
    "name": "Screen Is Cracked",
    "description": "There is nothing quite as annoying as a cracked screen, right? Though the cracked phone can be used for a long time, some day it might suddenly become unusable. So, it is advisable to contact an iPhone repair centre in Delhi. They may opt for iPhone screen replacement in this case. For this problem, there is a number of do it yourself kits available, but approaching the right service centre is a better option as they will finish the job at a reasonable price and accurately."
  },
  {
    "price": "$2,914.29",
    "picture": "http://placehold.it/32x32",
    "name": "Change the broken screen",
    "description": "this is description"
  },
  {
    "price": "$2,251.08",
    "picture": "https://cdn.comparitech.com/wp-content/uploads/2018/06/How-to-recover-lost-photos-on-your-android-device-1.jpg",
    "name": "iPhone Data Lost",
    "description": "It is quite frustrating when you lose all the important data from your phone. But this is yet another common problem in case of iPhones. If you have an iCloud backup, the solution will be easy. Just sync your device to iCloud-iPhone. Syncing can be done at night when it is locked. Your missing content will be available in the iCloud. But if you can’t find it there too, you must rush to an Apple store to find any possibilities of getting back the lost data."
  },
  {
    "price": "$2,221.53",
    "picture": "https://rapidrepair.in/wp-content/uploads/2018/12/The-camera-is-not-working-post-e1545808763127.png",
    "name": "The Camera Is Not Working",
    "description": "Your iPhone camera will not work if you have any restrictions that are enabled. You can check this by navigating through Settings-General instructions and turn on the Camera. Most of the camera problems will be solved here. If still the camera is not working, try resetting your phone as said earlier. If again you didn’t find any improvement, it could be an issue with the hardware. Take it to an iPhone service centre in Delhi to resolve the issue."
  },
  {
    "price": "$2,617.84",
    "picture": "https://rapidrepair.in/wp-content/uploads/2021/03/d5db61908ab3671ef472b679176be229_1200x630.jpg",
    "name": "Rapid Battery Drains",
    "description": "Are you stuck in the constant tussle between mobile gaming and a battery that won’t stop draining? Or are you someone who cannot function without a power bank? If you love playing games on your iPhone (thanks to the excellent display features) just like we do, you must be struggling with keeping the phone's battery alive when you really need it. Apple's iPhone is known as an incredibly powerful device as compared to other phones especially when it comes to gaming. The latest edge-to-edge display feature provides an even more enhanced gaming experience on the new range of iPhones.There is, however, one downside of playing games on your phone. The battery drains faster when used for gaming and this can be a real buzz killer. The constant need to charge the phone is surely a hassle and no one wants to rely on power banks everywhere they go. To help you save yourself the trouble of lugging around bulky power banks or being stuck to a charging point, we have collated a few tips through which you can improve the battery life of your iPhone and extend your favorite gaming sessions."
  },
  {
    "price": "$3,424.70",
    "picture": "https://rapidrepair.in/wp-content/uploads/2018/12/Damage-due-to-water-post-e1545808671443.png",
    "name": "Damage Due To Water",
    "description": "For all electronic equipment, water is a nightmare and the same is applicable in the case of iPhones. Don't worry if your phone gets submerged in water, as you can try many solutions before giving up. The first thing to do after taking the phone out of the water is to wipe away all the excess water using a tissue paper. Never try to switch on the phone immediately as it leads to permanent damage. The next thing you must do is take a cup of rice and put your phone in it. The rice will absorb the remaining moisture within 24 hours. Also, you can dismantle the phone and dry it manually, but it needs much skill. If the phone is still not working, you can contact the nearby service provider."
  },
  {
    "price": "$1,635.95",
    "picture": "http://placehold.it/32x32",
    "name": "Bluetooth Issues",
    "description": "Out of many common iPhone problems, issues with Bluetooth can be easily resolved by going to settings-general and selecting reset all options and settings. This will remove all saved settings along and solve your issue too."
  }
]